app/controllers/documents_controller.rb

    def index
        @documents = Document.all
---
SELECT "documents".* FROM "documents"

    def create
        @document = Document.new(document_params)

        if @document.save
---
INSERT INTO "documents" ("title", "body", "summary", "created_at", "updated_at", "publication_state") VALUES (?, ?, ?, ?, ?, ?)

    def update
      # @document.set_attributes(document_params)

      # if @document.valid?
      #   if @document.save
      #     flash[:success] = "Updated #{@document.title}"
      #     redirect_to document_path(@document)
      #   else
      #     flash.now[:danger] = unknown_error_message
      #     render :edit
      #   end
      @document = Document.find(params[:id])

      if @document.update(document_params)
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "documents" SET "title" = ?, "summary" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["title", "Test publication xxxx"], ["summary", "This is a test summary xxxx"], ["updated_at", "2019-12-08 09:33:45.895883"], ["id", 1]]

        def fetch_document
            @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]